Revit 2027 API
AssetPropertyList.InsertNewAssetAsColor Method
 Insert a new AssetPropertyDouble4 containing the input value to this list.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void InsertNewAssetAsColor(
	Color value,
	int index
)
Public Sub InsertNewAssetAsColor (
	value As Color,
	index As Integer
)
public:
void InsertNewAssetAsColor(
	Color^ value,
	int index
)
member InsertNewAssetAsColor :
        value : Color *
        index : int -> unit
Parameters
value Color
 The color value to insert.
index Int32
 An integer index.
Exceptions
Exception | Condition
ArgumentException |  index is out of range.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The asset property is not editable.
See Also
Reference
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace